import PageTitle from "@igraph/ui/components/PageTitle";
import Title from "@igraph/ui/components/Title";
import { Metadata } from "next";
import React from "react";

const Page = () => {
  return (
    <div className="max-w-4xl mx-auto">
      <PageTitle
        title="قوانین و حریم شخصی آی‌گرافیکال"
        description="با عضویت در سایت آی گرافیکال، شما قوانین و مقررات آی گرافیکال جهت استفاده از خدمات این سرویس را پذیرفته اید. لذا در ادامه به برخی از قوانین مهم آی گرافیکال اشاره می‌شود:"
      />

      <div className="space-y-3 mb-6 text-sm">
        <Title title="قوانین" className="text-xl" />
        {rules.map((rule, index) => (
          <p className="card" key={index}>
            {rule}
          </p>
        ))}
      </div>

      <div className="space-y-3 text-sm">
        <Title title="حریم شخصی کاربر" className="text-xl" />
        <div className="card text-sm">
          <pre className="text-sm"> {privacy}</pre>
        </div>
      </div>
    </div>
  );
};

const rules = [
  "هرگونه توزیع، کپی‌برداری، بازنشر، فروش یا بهره‌برداری تجاری از محتوای دوره‌ها و مطالب سایت آی‌گرافیکال، به هر شکل و در هر بستری ممنوع بوده و مشمول پیگرد قانونی خواهد بود.",
  "با عضویت در وب‌سایت آی‌گرافیکال، کاربر متعهد می‌شود در صورت تخلف از قوانین سایت، آی‌گرافیکال مجاز به مسدودسازی دسترسی کاربر و پیگیری حقوقی از طریق مراجع قانونی و وکیل رسمی شرکت خواهد بود.",
  "دسترسی به دوره‌ها صرفاً به‌صورت آنلاین امکان‌پذیر است و هرگونه دانلود، ضبط صفحه یا انتشار محتوای دوره‌ها از سوی کاربران غیرمجاز و ممنوع می‌باشد.",
  "هر خرید انجام‌شده، صرفاً برای استفاده شخصی و انفرادی خریدار بوده و کاربر تحت هیچ شرایطی مجاز به اشتراک‌گذاری حساب کاربری خود حتی با اعضای خانواده نمی‌باشد.",
  "کاربر با عضویت در سایت، رضایت خود را نسبت به عضویت در باشگاه پیامکی و دریافت اطلاع‌رسانی‌ها و پیامک‌های مرتبط اعلام می‌دارد.",
  "مسئولیت صحت اطلاعات وارد شده از جمله نام، نام خانوادگی و کد ملی به عهده کاربر است. در صورت صدور گواهی با اطلاعات نادرست، آی‌گرافیکال مسئولیتی در قبال اصلاح یا صدور مجدد مدرک نخواهد داشت.",
  "کاربر با ارسال نظر یا مشارکت در محتوای سایت، به آی‌گرافیکال اجازه می‌دهد تصویر پروفایل او به همراه نام نمایشی در سایت و شبکه‌های اجتماعی رسمی مجموعه منتشر شود.",
  "هرگونه تلاش برای نفوذ، هک، دست‌کاری یا ایجاد اختلال در سیستم‌های فنی یا محتوای سایت، تخلف محسوب شده و پیگیری قضایی در پی خواهد داشت.",
  "بازپرداخت وجه فقط در مواردی که نقص جدی در دسترسی یا کیفیت دوره‌ها از سوی آی‌گرافیکال اثبات شود، امکان‌پذیر است و بررسی آن منوط به نظر تیم پشتیبانی خواهد بود.",
  "تمامی حقوق معنوی و مالکیت فکری دوره‌ها و محتوای ارائه‌شده متعلق به آی‌گرافیکال بوده و هرگونه استفاده خارج از چهارچوب‌های تعیین‌شده، نقض حقوق مؤلف محسوب می‌شود.",
];

const privacy = `حریم خصوصی کاربران در سایت آی‌گرافیکال از بالاترین اولویت‌ها برخوردار است. ما متعهد هستیم تا اطلاعات شخصی کاربران را به‌طور کامل محافظت کرده و محیطی امن برای استفاده از خدمات سایت فراهم کنیم. به همین منظور، از فناوری‌های مختلف رمزنگاری برای انتقال داده‌ها میان کاربر و سرور استفاده می‌کنیم تا از دسترسی غیرمجاز جلوگیری شود.

اطلاعاتی که از کاربران دریافت می‌شود، صرفاً در راستای ارائه خدمات بهتر و دقیق‌تر مورد استفاده قرار می‌گیرد و هیچ‌گونه اطلاعات شخصی کاربران به اشخاص یا نهادهای ثالث منتقل یا فروخته نخواهد شد.

آی‌گرافیکال تنها اطلاعاتی را از شما درخواست می‌کند که برای انجام خدمات مورد نیاز است و هرگونه استفاده از اطلاعات کاربران خارج از چهارچوب این خدمات، برای آی‌گرافیکال غیرمجاز تلقی می‌شود.

ما همواره تلاش می‌کنیم تا با به‌روزرسانی زیرساخت‌های امنیتی، فضای مطمئن‌تری برای شما کاربران گرامی فراهم سازیم.`;

export default Page;

export const metadata: Metadata = {
  title: "قوانین و حریم شخصی",
  description:
    " لطفاً قبل از استفاده از خدمات ما، قوانین و مقررات را مطالعه کنید. شامل شرایط استفاده، مسئولیت‌ها و حقوق کاربران",
};
